In [2]:
#DHZ 1951 
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame ({
    "VarA": ["aa", None, "cc"],
    "VarB": [20, 30, None],
    "VarC": [1234, 3456, 6789],
}, 
    index = ["Caso 1","Caso 2","Caso 3"]
)
df

        VarA  VarB  VarC
Caso 1    aa  20.0  1234
Caso 2  None  30.0  3456
Caso 3    cc   NaN  6789

In [6]:
pd.isnull(df)

         VarA   VarB   VarC
Caso 1  False  False  False
Caso 2   True  False  False
Caso 3  False   True  False

In [7]:
#DHZ 1951
df.dropna(subset=["VarA","VarB"])

       VarA  VarB  VarC
Caso 1   aa  20.0  1234

In [8]:
#DHZ 1951
df

        VarA  VarB  VarC
Caso 1    aa  20.0  1234
Caso 2  None  30.0  3456
Caso 3    cc   NaN  6789

In [10]:
df.fillna(23)

       VarA  VarB  VarC
Caso 1   aa  20.0  1234
Caso 2   23  30.0  3456
Caso 3   cc  23.0  6789